{"pageProps":{"posts":[{"title":"在腾讯云上的Serverless的分享\n","date":"2021-06-29T00:00:00.000Z","draft":false,"tags":["weixin","serverless","haoel"],"summary":"微服务是一把双刃剑，在让我们提升开发效率的同时，也会让运维难度加大，尤其是 Serverless，其微服务器的粒度更小，随着数量的增长，缺乏配套设施的架构会变得一发不可收拾，而治理和运维的难度也随之呈现级数性增长。本次分享主要讨论如何对 Serverless 进行更有效的服务治理。本文由MegaEase 创始人、腾讯云TVP 陈皓在 Techo TVP 开发者峰会 ServerlessDays China 2021上的演讲《Serverless 的服务治理》整理而成，向大家分享。\n","slug":"2021-06-29-879"},{"title":"技术分享：Sledge: Serverless + WASM Runtime\n","date":"2021-05-20T00:00:00.000Z","draft":false,"tags":["youtube","serverless","webassembly"],"summary":"An Introduction about -  What is WebAssembly -  How does WebAssembly impact Serverless/FaaS technology.  -  Sledge - multiple functions in one process.\n","slug":"2021-05-20-878"},{"title":"Going Serverless with OpenFaaS and Golang - The Ultimate Setup and Workflow\n","date":"2019-12-09T00:00:00.000Z","draft":false,"tags":["golang","serverless"],"summary":"Serverless applications have been cool and hype for a while now and some interesting and useful platforms/tools/frameworks are emerging now....\n","slug":"2019-12-09-208"},{"title":"看到一篇介绍 serverless 架构的文章，觉得写得比较客观，分享一下\n","date":"2019-12-07T00:00:00.000Z","draft":false,"tags":["serverless"],"summary":"看到一篇介绍 serverless 架构的文章，觉得写得比较客观，分享一下\n","slug":"2019-12-07-197"},{"title":"Cloud Programming Simplified: A Berkeley View on Serverless Computing - RISE Lab\n","date":"2019-12-07T00:00:00.000Z","draft":false,"tags":["serverless"],"summary":"David Patterson and Ion Stoica The publication of “Above the Clouds: A Berkeley View of Cloud Computing” on February 10, 2009 cleared up the considerable confusion about the new notion of “Cloud Computing.” The paper defined what Cloud Computing was, where it came from, why some were excited by it, what were its technical advantages, and what were the obstacles and research opportunities for it to become even more popular.  More than 17,000 citations to this paper and an abridged version in CACM—with more than 1000 in the past year—document that it continues to shape the discussions and the evolution of Cloud Computing. “Cloud Programming Simplified: A Berkeley View on Serverless Computing” with some of the same authors commemorates the…\n","slug":"2019-12-07-198"}],"tag":"serverless"},"__N_SSG":true}